Revit 2027 API
BuiltInFailures.StairRampFailures.PathDoesntJoinToBorderRisersFailure Property
 Path doesn't join to border risers is not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PathDoesntJoinToBorderRisersFailure { get; }
Public Shared ReadOnly Property PathDoesntJoinToBorderRisersFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PathDoesntJoinToBorderRisersFailure {
	FailureDefinitionId^ get ();
}
static member PathDoesntJoinToBorderRisersFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace